import React from "react";
import { STPageContainer,STPageContentWrapper,} from "../shared/styledComponents";

export const PrivacyPolicySinhala = () => {
  return (
    <div>
        <section className="hero is-light">
          <div className="hero-body">
            <div className="container">
              <h1 className="title">රහස්‍යතා ප්‍රතිපත්ති</h1>
              <h2 className="subtitle">
                Survive Together වෙබ් අඩවිය සඳහා රහස්‍යතා ප්‍රතිපත්ති
              </h2>
            </div>
          </div>
        </section>

        <STPageContainer className="container">
          <STPageContentWrapper>
            <br />
            <p>
              <a href="https://survivetogether.org">
                https://survivetogether.org/
              </a>
              වෙතින් ප්‍රවේශ විය හැකි Survive Together හි අපගේ ප්‍රධාන
              ප්‍රමුඛතාවයන්ගෙන් එකක් වන්නේ මෙම වෙබ් අඩවියට පැමිණෙන පුද්ගලයන්ගේ
              පෞද්ගලිකත්වයයි. මෙම රහස්‍යතා ප්‍රතිපත්ති ලේඛනයේ Survive Together
              විසින් එකතු කරන ලද / පටිගත කරන ලද තොරතුරු වර්ග සහ අප එය භාවිතා කරන
              ආකාරය අඩංගු වේ.
            </p>
            <p>
              ඔබට අමතර ප්‍රශ්න ඇත්නම් හෝ අපගේ රහස්‍යතා ප්‍රතිපත්තිය පිළිබඳ වැඩි
              විස්තර අවශ්‍ය නම්, අප හා සම්බන්ධ වීමට පසුබට නොවන්න.
            </p>
            <p>
              මෙම රහස්‍යතා ප්‍රතිපත්තිය අදාළ වන්නේ අපගේ අන්තර්ජාල (Online)
              ක්‍රියාකාරකම් සඳහා පමණක් වන අතර අපගේ වෙබ් අඩවියට පැමිණෙන
              පුද්ගලයන්ට වලංගු වන්නේ ඔවුන් බෙදාගත් සහ/ හෝ Survive Together තුළ
              එකතු කළ තොරතුරු සම්බන්ධයෙන් පමණි. මෙම ප්‍රතිපත්තිය අන්තර්ජාලයෙන්
              බැහැරව (Offline) හෝ මෙම වෙබ් අඩවිය හැර වෙනත් නාලිකා හරහා එකතු කරන
              ලද තොරතුරු වලට අදාළ නොවේ.
            </p>
            <br />
            <h2 className="title is-3">ප්‍රතිඥාව</h2>
            <p>
              අපගේ වෙබ් අඩවිය භාවිතා කිරීමෙන්, ඔබ මෙයින් අපගේ රහස්‍යතා
              ප්‍රතිපත්තියට එකඟ වන අතර එහි නියමයන්ට එකඟ වේ.
            </p>
            <br />
            <h2 className="title is-3">අප රැස් කරන තොරතුරු</h2>
            <p>
              ඔබෙන් ඉල්ලා සිටින පුද්ගලික තොරතුරු, සහ එය ලබා දීමට ඔබෙන් ඉල්ලා
              සිටීමට හේතු, ඔබේ පුද්ගලික තොරතුරු ලබා දෙන ලෙස අපි ඔබෙන් ඉල්ලා
              සිටින මොහොතේදී ඔබට පැහැදිලි වනු ඇත.
            </p>
            <p>
              ඔබ අපව සෘජු ලෙස සම්බන්ධ කර ගන්නේ නම්, ඔබගේ නම, ඊමේල් ලිපිනය,
              දුරකථන අංකය, පණිවිඩයේ අන්තර්ගතය සහ / හෝ ඔබ අප වෙත එවිය හැකි
              ඇමුණුම් සහ ඔබ සැපයීමට තෝරාගන්නා වෙනත් තොරතුරු වැනි අමතර දත්ත අපට
              ලැබෙනු ඇත.
            </p>
            <p>
              ඔබ ඔබේ පුද්ගලික තොරතුරු (නම, දුරකථන අංකය සහ ලිපිනය වැනි) එකතු කළ
              විට, මෙම තොරතුරු වෙබ් අඩවියට පිවිසිය හැකි ඕනෑම අයෙකුට ප්‍රසිද්ධියේ
              පෙන්වනු ඇත.
            </p>

            <br />

            <h2 className="title is-3">අපි ඔබේ තොරතුරු භාවිතා කරන ආකාරය</h2>

            <p>
              අපි එකතු කරන තොරතුරු (ගූගල් විශ්ලේෂණ භාවිතා කරමින් ඔබ පිවිසෙන පිටු
              වැනි) විවිධ ආකාරවලින් භාවිතා කරමු:
            </p>

            <ul
              style={{
                listStyleType: "disc",
                marginLeft: 32,
              }}
            >
              <li>
                අපගේ වෙබ් අඩවිය සැපයීම, ක්‍රියාත්මක කිරීම සහ නඩත්තු කිරීම සඳහා.
              </li>
              <li>
                අපගේ වෙබ් අඩවිය වැඩි දියුණු කිරීම, පුද්ගලීකරණය කිරීම සහ පුළුල්
                කිරීම සඳහා.
              </li>
              <li>
                ඔබ අපගේ වෙබ් අඩවිය භාවිතා කරන ආකාරය තේරුම් ගෙන විශ්ලේෂණය කිරීම
                සඳහා.
              </li>
              <li>
                {" "}
                නව නිෂ්පාදන, සේවා, විශේෂාංග සහ ක්‍රියාකාරීත්වය සංවර්ධනය කිරීම
                සඳහා.
              </li>
              <li>
                ඔබගේ අවශ්‍යතා සපුරාලීමට ඔබට උපකාර කිරීම සඳහා සෘජු ලෙස හෝ අපගේ
                හවුල්කරුවෙකු හරහා ඔබ සමඟ සන්නිවේදනය කිරීම සඳහා.
              </li>
              <li>ඔබට ඊමේල් යැවීම සඳහා.</li>
              <li>වංචා සොයාගෙන වළක්වා ගැනීම සඳහා.</li>
            </ul>

            <br />

            <h2 className="title is-3">ලඝුගත ලිපිගොනු</h2>

            <p>
              Survive Together ලඝුගත ලිපිගොනු භාවිතා කිරීමේ සම්මත ක්‍රියා
              පටිපාටියක් අනුගමනය කිරීම සිදුකරයි. මෙම ලිපිගොනු පුද්ගලයන් වෙබ්
              අඩවි වලට පිවිසෙන විට ලඝුගත වේ. සියලුම සත්කාරක සමාගම් මෙය සිදු කරන
              අතර, මෙය සත්කාරක සේවා විශ්ලේෂණවල කොටසකි. ලඝුගත ලිපිගොනු මගින්
              රැස්කරන තොරතුරු අතරට අන්තර්ජාල ප්‍රොටෝකෝලය (IP) ලිපින, බ්‍රව්සර්
              වර්ගය, අන්තර්ජාල සේවා සැපයුම්කරු (ISP), දිනය සහ වේලාව මුද්දරය,
              පිටු යොමු කිරීම / පිටවීම සහ සමහර අවස්තා වල ක්ලික් කිරීම් ගණන
              ඇතුළත් වේ. පුද්ගලිකව හඳුනාගත හැකි කිසිදු තොරතුරකට මේවා සම්බන්ධ
              නොවේ. තොරතුරු වල පරමාර්ථය වන්නේ ප්‍රවණතා විශ්ලේෂණය කිරීම, වෙබ්
              අඩවිය පරිපාලනය කිරීම, වෙබ් අඩවියේ පරිශීලකයින්ගේ චලනයන් නිරීක්ෂණය
              කිරීම සහ ජන විකාශ තොරතුරු රැස් කිරීම ය. අපගේ රහස්‍යතා ප්‍රතිපත්තිය
              නිර්මාණය කරන ලද්දේ
              <a
                href="https://www.privacypolicygenerator.info"
                target="_blank"
                rel="noopener noreferrer"
              >
                “රහස්‍යතා ප්‍රතිපත්ති උත්පාදක”
              </a>{" "}
              සහ{" "}
              <a
                href="https://www.privacypolicytemplate.net/"
                target="_blank"
                rel="noopener noreferrer"
              >
                “රහස්‍යතා ප්‍රතිපත්ති මර්ගකය”
              </a>
              ආධාරයෙන් ය.
            </p>

            <br />

            <h2 className="title is-3">කුකීස් සහ වෙබ් බීකන්ස්</h2>

            <p>
              වෙනත් ඕනෑම වෙබ් අඩවියක් මෙන්, Survive Together{" "}
              <strong>කුකීස්</strong> භාවිතා කරයි. මෙම කුකීස් නරඹන්නන්ගේ මනාපයන්
              සහ පුද්ගලයින් ප්‍රවේශ වූ හෝ පිවිසුණු වෙබ් අඩවියේ පිටු ඇතුළු
              තොරතුරු ගබඩා කිරීමට භාවිතා කරයි. වෙබ් අඩවිය තුලට පුද්ගලයන් පැමිණි
              බ්‍රව්සර් වර්ගය සහ / හෝ වෙනත් තොරතුරු මත පදනම්ව අපගේ වෙබ් පිටු
              අන්තර්ගතය රිසිකරණය කිරීමෙන් පරිශීලකයින්ගේ අත්දැකීම් ප්‍රශස්ත කිරීම
              සඳහා තොරතුරු භාවිතා කරයි.
            </p>

            <p>
              කුකීස් පිළිබඳ වැඩි විස්තර සඳහා කරුණාකර{" "}
              <a
                href="https://www.cookieconsent.com/what-are-cookies/"
                target="_blank"
                rel="noopener noreferrer"
              >
                &quot;කුකීස් යනු කුමක්ද&quot;
              </a>{" "}
              කියවන්න.
            </p>

            <br />

            <h2 className="title is-3">
              CCPA රහස්‍යතා අයිතිවාසිකම් (මාගේ පුද්ගලික තොරතුරු විකිණීමෙන්
              වලකින්න)
            </h2>

            <p>
              CCPA යටතේ, වෙනත් අයිතිවාසිකම් අතර, කැලිෆෝනියා පාරිභෝගිකයින්ට පහත
              සඳහන් දේ කිරීමට අයිතිය ඇත:
            </p>
            <p>
              ව්‍යාපාරයක් විසින් පාරිභෝගිකයෙකුගේ එකතු කරන ලද පුද්ගලික දත්ත ඉල්ලා
              සිටීම.
            </p>
            <p>
              ව්‍යාපාරයක් විසින් පාරිභෝගිකයින් පිළිබඳව එකතු කර ඇති පුද්ගලික දත්ත
              කාණ්ඩ සහ විශේෂිත කොටස් අනාවරණය කර සිටීම.
            </p>
            <p>
              ව්‍යාපාරයක් විසින් එකතු කරන ලද පාරිභෝගිකයා පිළිබඳ පුද්ගලික දත්ත
              මකා දැමීමට ව්‍යාපාරයෙන් ඉල්ලීමක් කර සිටීම.
            </p>
            <p>
              ව්‍යාපාරයක් විසින් පාරිභෝගිකයෙකුගේ පුද්ගලික දත්ත විකුණන අවස්ථාවකදී
              එම පාරිභෝගිකයාගේ පුද්ගලික දත්ත විකිනීමට ඉඩ නොදෙන ලෙස ඉල්ලා සිටීම.
            </p>
            <p>
              ඔබ ඉල්ලීමක් කරන්නේ නම්, ඔබට ප්‍රතිචාර දැක්වීමට අපට මාසයක් තිබේ.
              නමුත් ඔබ අපගේ වෙබ් අඩවියට ඉදිරිපත් කරන තොරතුරු ප්‍රසිද්ධියේ ලබා ගත
              හැකි බව කරුණාවෙන් සලකන්න. ඔබ මෙම අයිතිවාසිකම්වලින් එකක් හෝ
              ක්‍රියාත්මක කිරීමට කැමති නම්, කරුණාකර අප හා සම්බන්ධ වන්න.
            </p>

            <br />

            <h2 className="title is-3">GDPR දත්ත ආරක්ෂණ අයිතිවාසිකම්</h2>

            <p>
              ඔබගේ සියලු දත්ත ආරක්ෂණ අයිතිවාසිකම් පිළිබඳව ඔබ හොඳින් දැන සිටින
              බවට සහතික කර ගැනීමට අපි කැමතියි. සෑම පරිශීලකයෙකුටම පහත සඳහන් දේ
              සඳහා හිමිකම් ඇත:
            </p>
            <p>
              ප්‍රවේශ වීමේ අයිතිය - ඔබේ පුද්ගලික දත්තවල පිටපත් ඉල්ලා සිටීමට ඔබට
              අයිතියක් ඇත. නමුත් ඔබ අපගේ වෙබ් අඩවියට ඉදිරිපත් කරන තොරතුරු
              ප්‍රසිද්ධියේ ලබා ගත හැකි බව කරුණාවෙන් සලකන්න.
            </p>
            <p>
              නිවැරදි කිරීමේ අයිතිය - සාවද්‍ය යැයි ඔබ විශ්වාස කරන ඕනෑම තොරතුරක්
              අප විසින් නිවැරදි කරන ලෙස ඉල්ලා සිටීමට ඔබට අයිතියක් ඇත. අසම්පූර්ණ
              යැයි ඔබ විශ්වාස කරන තොරතුරු සම්පුර්ණ කරන ලෙස ඉල්ලා සිටීමට ඔබට
              අයිතියක් ඇත.
            </p>
            <p>
              මකාදැමීමේ අයිතිය - යම් කොන්දේසි යටතේ ඔබගේ පුද්ගලික දත්ත මකා දමන
              ලෙස ඉල්ලා සිටීමට ඔබට අයිතියක් ඇත.
            </p>
            <p>
              සැකසීම සීමා කිරීමේ අයිතිය - යම් යම් කොන්දේසි යටතේ ඔබේ පුද්ගලික
              දත්ත සැකසීම සීමා කරන ලෙස ඉල්ලා සිටීමට ඔබට අයිතියක් ඇත.
            </p>
            <p>
              සැකසීමට විරෝධය දැක්වීමේ අයිතිය - යම් යම් කොන්දේසි යටතේ ඔබේ
              පුද්ගලික දත්ත සැකසීමට විරෝධය දැක්වීමට ඔබට අයිතියක් ඇත.
            </p>
            <p>
              දත්ත සුවහබවට ඇති අයිතිය - අප විසින් රැස් කරන ලද දත්ත වෙනත් ආයතනයකට
              හෝ සෘජුවම ඔබට යම් කොන්දේසි යටතේ මාරු කරන ලෙස ඉල්ලා සිටීමට ඔබට
              අයිතියක් ඇත.
            </p>
            <p>
              ඔබ ඉල්ලීමක් කරන්නේ නම්, ඔබට ප්‍රතිචාර දැක්වීමට අපට මාසයක් තිබේ. ඔබ
              මෙම අයිතිවාසිකම්වලින් එකක් හෝ ක්‍රියාත්මක කිරීමට කැමති නම්,
              කරුණාකර අප හා සම්බන්ධ වන්න.
            </p>

            <br />

            <h2 className="title is-3">ළමා තොරතුරු</h2>

            <p>
              අපගේ ප්‍රමුඛතාවයේ තවත් කොටසක් වන්නේ අන්තර්ජාලය භාවිතා කරන අතරතුර
              ළමයින් සඳහා ආරක්ෂාව එක් කිරීමයි. ඔවුන්ගේ අන්තර්ජාල ක්‍රියාකාරකම්
              නිරීක්ෂණය කිරීමට, සහභාගී වීමට සහ / හෝ අධීක්ෂණයට සහ මග පෙන්වීමට අපි
              දෙමාපියන් සහ භාරකරුවන් දිරිමත් කරමු.
            </p>

            <p>
              වයස අවුරුදු 13 ට අඩු ළමයින්ගෙන් පෞද්ගලිකව හඳුනාගත හැකි තොරතුරු
              දැනුවත්ව එකතු කර නොගනී. ළමයින් සම්බන්ධ කිසිදු පෞද්ගලික තොරතුරක්
              ලබා නොදෙන ලෙස අපි ඔබට නිර්දේශ කරමු. ඔබේ දරුවා අපගේ වෙබ් අඩවියේ
              මෙවැනි තොරතුරු ලබා දී ඇතැයි ඔබ සිතන්නේ නම්, වහාම අපව සම්බන්ධ කර
              ගන්නා ලෙස අපි ඔබව තරයේ දිරිමත් කරමු. එවැනි තොරතුරු අපගේ
              වාර්තාවලින් වහාම ඉවත් කිරීමට අපි අපගේ උපරිම උත්සාහය දරන්නෙමු.
            </p>
          </STPageContentWrapper>
        </STPageContainer>
      </div>
  );
};
